#โปรแกรมตัดเกรด 5 ระดับ
# A(80-100) , B(70-79) , C(60-69) , D(50-59) , E(น้อยกว่า 49 ลงมา)
g = int(input(f"กรอกคะแนนงาน(เต็ม 50) :"))
h = int(input(f"กรอกคะแนนสอบ(เต็ม 30) :"))
x = int(input(f"กรอกคะแนนจิตวิสัย(เต็ม 20) :"))
P = g+h+x
print(f"คะแนนที่ได้คือ = { P }")
if ( P >= 80) :
    print (f"grade : A #เก่งจังเลยยย #พ่อแม่ภูมิใจ")
elif ( P >= 70) :
    print (f"grade : B #ยอดเยี่ยมมมม #เกือบได้ A แล้วเชียว")
elif ( P >= 60) :
    print (f"grade : C #พอใช้ #พยายามขึ้นอีกกกกกกก")
elif ( P >= 50) :
    print (f"grade : D #เกือบบบ #พยายามอีก สู้ๆ")
elif ( P <= 49) :
    print (f"grade : E #กากจังวะ #ลงเรียนใหม่เดี๋ยวนี้")